---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.HiddenLineViews
source: html/9c3b73b4-0af6-00f7-01f2-2f5890c03e92.htm
---
# Autodesk.Revit.DB.PrintParameters.HiddenLineViews Property

The hidden line views type.

## Syntax (C#)
```csharp
public HiddenLineViewsType HiddenLineViews { get; set; }
```